yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8tl52f4.h
#define PXS_RXINSRL_RXINS0       PXS_RXINSRL_bit.RXINS0
#define PXS_RXINSRL_RXINS1       PXS_RXINSRL_bit.RXINS1
#define PXS_RXINSRL_RXINS2       PXS_RXINSRL_bit.RXINS2
#define PXS_RXINSRL_RXINS3       PXS_RXINSRL_bit.RXINS3
#define PXS_RXINSRL_RXINS4       PXS_RXINSRL_bit.RXINS4
#define PXS_RXINSRL_RXINS5       PXS_RXINSRL_bit.RXINS5
#define PXS_RXINSRL_RXINS6       PXS_RXINSRL_bit.RXINS6
#define PXS_RXINSRL_RXINS7       PXS_RXINSRL_bit.RXINS7

#define PXS_TXENRH_TXEN8         PXS_TXENRH_bit.TXEN8
#define PXS_TXENRH_TXEN9         PXS_TXENRH_bit.TXEN9
#define PXS_TXENRH_TXEN10        PXS_TXENRH_bit.TXEN10
#define PXS_TXENRH_TXEN11        PXS_TXENRH_bit.TXEN11
#define PXS_TXENRH_TXEN12        PXS_TXENRH_bit.TXEN12
#define PXS_TXENRH_TXEN13        PXS_TXENRH_bit.TXEN13
#define PXS_TXENRH_TXEN14        PXS_TXENRH_bit.TXEN14
#define PXS_TXENRH_TXEN15        PXS_TXENRH_bit.TXEN15

#define PXS_TXENRL_TXEN0         PXS_TXENRL_bit.TXEN0
#define PXS_TXENRL_TXEN1         PXS_TXENRL_bit.TXEN1
#define PXS_TXENRL_TXEN2         PXS_TXENRL_bit.TXEN2
#define PXS_TXENRL_TXEN3         PXS_TXENRL_bit.TXEN3
#define PXS_TXENRL_TXEN4         PXS_TXENRL_bit.TXEN4
#define PXS_TXENRL_TXEN5         PXS_TXENRL_bit.TXEN5
#define PXS_TXENRL_TXEN6         PXS_TXENRL_bit.TXEN6
#define PXS_TXENRL_TXEN7         PXS_TXENRL_bit.TXEN7

#define PXS_MAXENRH_MAXEN8       PXS_MAXENRH_bit.MAXEN8
#define PXS_MAXENRH_MAXEN9       PXS_MAXENRH_bit.MAXEN9

#define PXS_MAXENRL_MAXEN0       PXS_MAXENRL_bit.MAXEN0
#define PXS_MAXENRL_MAXEN1       PXS_MAXENRL_bit.MAXEN1
#define PXS_MAXENRL_MAXEN2       PXS_MAXENRL_bit.MAXEN2
#define PXS_MAXENRL_MAXEN3       PXS_MAXENRL_bit.MAXEN3
#define PXS_MAXENRL_MAXEN4       PXS_MAXENRL_bit.MAXEN4
#define PXS_MAXENRL_MAXEN5       PXS_MAXENRL_bit.MAXEN5
#define PXS_MAXENRL_MAXEN6       PXS_MAXENRL_bit.MAXEN6
#define PXS_MAXENRL_MAXEN7       PXS_MAXENRL_bit.MAXEN7

#define PXS_RXSRH_VALID8         PXS_RXSRH_bit.VALID8
#define PXS_RXSRH_VALID9         PXS_RXSRH_bit.VALID9

#define PXS_RXSRL_VALID0         PXS_RXSRL_bit.VALID0
#define PXS_RXSRL_VALID1         PXS_RXSRL_bit.VALID1
#define PXS_RXSRL_VALID2         PXS_RXSRL_bit.VALID2
#define PXS_RXSRL_VALID3         PXS_RXSRL_bit.VALID3
#define PXS_RXSRL_VALID4         PXS_RXSRL_bit.VALID4
#define PXS_RXSRL_VALID5         PXS_RXSRL_bit.VALID5
#define PXS_RXSRL_VALID6         PXS_RXSRL_bit.VALID6
#define PXS_RXSRL_VALID7         PXS_RXSRL_bit.VALID7

#define PXS_RX0CSSELR_RX0CSSEL   PXS_RX0CSSELR_bit.RX0CSSEL

#define PXS_RX1CSSELR_RX1CSSEL   PXS_RX1CSSELR_bit.RX1CSSEL

#define PXS_RX2CSSELR_RX2CSSEL   PXS_RX2CSSELR_bit.RX2CSSEL

#define PXS_RX3CSSELR_RX3CSSEL   PXS_RX3CSSELR_bit.RX3CSSEL

#define PXS_RX4CSSELR_RX4CSSEL   PXS_RX4CSSELR_bit.RX4CSSEL

#define PXS_RX5CSSELR_RX5CSSEL   PXS_RX5CSSELR_bit.RX5CSSEL

#define PXS_RX6CSSELR_RX6CSSEL   PXS_RX6CSSELR_bit.RX6CSSEL

#define PXS_RX7CSSELR_RX7CSSEL   PXS_RX7CSSELR_bit.RX7CSSEL

#define PXS_RX8CSSELR_RX8CSSEL   PXS_RX8CSSELR_bit.RX8CSSEL

#define PXS_RX9CSSELR_RX9CSSEL   PXS_RX9CSSELR_bit.RX9CSSEL

#endif

/*-------------------------------------------------------------------------
 *      ProxSense bit masks
 *-----------------------------------------------------------------------*/
#define MASK_PXS_CR1_LOW_POWER   0x20
#define MASK_PXS_CR1_START       0x40
#define MASK_PXS_CR1_PXSEN       0x80

#define MASK_PXS_CR2_SYNCEDGE    0x01
#define MASK_PXS_CR2_SYNCEN      0x02
#define MASK_PXS_CR2_RXCOUPLING  0x04
#define MASK_PXS_CR2_RXGROUP     0x08
#define MASK_PXS_CR2_NOISEDETEN  0x20
#define MASK_PXS_CR2_FCCITEN     0x40
#define MASK_PXS_CR2_EOCITEN     0x80

#define MASK_PXS_CR3_VTHR        0x0F
#define MASK_PXS_CR3_BIAS        0x30
#define MASK_PXS_CR3_STAB        0xC0

#define MASK_PXS_ISR_SYNC_OVRF   0x04
#define MASK_PXS_ISR_SYNCPF      0x08
#define MASK_PXS_ISR_CIPF        0x10
#define MASK_PXS_ISR_NOISEDETF   0x20
#define MASK_PXS_ISR_FCCF        0x40
#define MASK_PXS_ISR_EOCF        0x80

#define MASK_PXS_CKCR1_PASSLEN   0x07
#define MASK_PXS_CKCR1_PREUPLENSC 0x70

#define MASK_PXS_CKCR2_INCPHASE  0x01
#define MASK_PXS_CKCR2_ANADEAD   0x02
#define MASK_PXS_CKCR2_PRESC     0x70

#define MASK_PXS_RXENRH_RXEN8    0x01
#define MASK_PXS_RXENRH_RXEN9    0x02

#define MASK_PXS_RXENRL_RXEN0    0x01
#define MASK_PXS_RXENRL_RXEN1    0x02
#define MASK_PXS_RXENRL_RXEN2    0x04
#define MASK_PXS_RXENRL_RXEN3    0x08
#define MASK_PXS_RXENRL_RXEN4    0x10
#define MASK_PXS_RXENRL_RXEN5    0x20
#define MASK_PXS_RXENRL_RXEN6    0x40
#define MASK_PXS_RXENRL_RXEN7    0x80

#define MASK_PXS_RXCR1H_RXCR1_8  0x01
#define MASK_PXS_RXCR1H_RXCR1_9  0x02

#define MASK_PXS_RXCR1L_RXCR1_0  0x01
#define MASK_PXS_RXCR1L_RXCR1_1  0x02
#define MASK_PXS_RXCR1L_RXCR1_2  0x04
#define MASK_PXS_RXCR1L_RXCR1_3  0x08
#define MASK_PXS_RXCR1L_RXCR1_4  0x10
#define MASK_PXS_RXCR1L_RXCR1_5  0x20
#define MASK_PXS_RXCR1L_RXCR1_6  0x40
#define MASK_PXS_RXCR1L_RXCR1_7  0x80

#define MASK_PXS_RXCR2H_RXCR2_8  0x01
#define MASK_PXS_RXCR2H_RXCR2_9  0x02

#define MASK_PXS_RXCR2L_RXCR2_0  0x01
#define MASK_PXS_RXCR2L_RXCR2_1  0x02
#define MASK_PXS_RXCR2L_RXCR2_2  0x04
#define MASK_PXS_RXCR2L_RXCR2_3  0x08
#define MASK_PXS_RXCR2L_RXCR2_4  0x10
#define MASK_PXS_RXCR2L_RXCR2_5  0x20
#define MASK_PXS_RXCR2L_RXCR2_6  0x40
#define MASK_PXS_RXCR2L_RXCR2_7  0x80

#define MASK_PXS_RXCR3H_RXCR3_8  0x01
#define MASK_PXS_RXCR3H_RXCR3_9  0x02

#define MASK_PXS_RXCR3L_RXCR3_0  0x01
#define MASK_PXS_RXCR3L_RXCR3_1  0x02
#define MASK_PXS_RXCR3L_RXCR3_2  0x04
#define MASK_PXS_RXCR3L_RXCR3_3  0x08
#define MASK_PXS_RXCR3L_RXCR3_4  0x10
#define MASK_PXS_RXCR3L_RXCR3_5  0x20
#define MASK_PXS_RXCR3L_RXCR3_6  0x40
#define MASK_PXS_RXCR3L_RXCR3_7  0x80

#define MASK_PXS_RXINSRH_RXINS8  0x01
#define MASK_PXS_RXINSRH_RXINS9  0x02

#define MASK_PXS_RXINSRL_RXINS0  0x01
#define MASK_PXS_RXINSRL_RXINS1  0x02
#define MASK_PXS_RXINSRL_RXINS2  0x04
#define MASK_PXS_RXINSRL_RXINS3  0x08
#define MASK_PXS_RXINSRL_RXINS4  0x10
#define MASK_PXS_RXINSRL_RXINS5  0x20
#define MASK_PXS_RXINSRL_RXINS6  0x40
#define MASK_PXS_RXINSRL_RXINS7  0x80

#define MASK_PXS_TXENRH_TXEN8    0x01
#define MASK_PXS_TXENRH_TXEN9    0x02
#define MASK_PXS_TXENRH_TXEN10   0x04
#define MASK_PXS_TXENRH_TXEN11   0x08
#define MASK_PXS_TXENRH_TXEN12   0x10
#define MASK_PXS_TXENRH_TXEN13   0x20
#define MASK_PXS_TXENRH_TXEN14   0x40
#define MASK_PXS_TXENRH_TXEN15   0x80

#define MASK_PXS_TXENRL_TXEN0    0x01
#define MASK_PXS_TXENRL_TXEN1    0x02
#define MASK_PXS_TXENRL_TXEN2    0x04
#define MASK_PXS_TXENRL_TXEN3    0x08
#define MASK_PXS_TXENRL_TXEN4    0x10
#define MASK_PXS_TXENRL_TXEN5    0x20
#define MASK_PXS_TXENRL_TXEN6    0x40
#define MASK_PXS_TXENRL_TXEN7    0x80

#define MASK_PXS_MAXENRH_MAXEN8  0x01
#define MASK_PXS_MAXENRH_MAXEN9  0x02

#define MASK_PXS_MAXENRL_MAXEN0  0x01
#define MASK_PXS_MAXENRL_MAXEN1  0x02
#define MASK_PXS_MAXENRL_MAXEN2  0x04
#define MASK_PXS_MAXENRL_MAXEN3  0x08
#define MASK_PXS_MAXENRL_MAXEN4  0x10
#define MASK_PXS_MAXENRL_MAXEN5  0x20
#define MASK_PXS_MAXENRL_MAXEN6  0x40
#define MASK_PXS_MAXENRL_MAXEN7  0x80

#define MASK_PXS_RXSRH_VALID8    0x01
#define MASK_PXS_RXSRH_VALID9    0x02

#define MASK_PXS_RXSRL_VALID0    0x01
#define MASK_PXS_RXSRL_VALID1    0x02
#define MASK_PXS_RXSRL_VALID2    0x04
#define MASK_PXS_RXSRL_VALID3    0x08
#define MASK_PXS_RXSRL_VALID4    0x10
#define MASK_PXS_RXSRL_VALID5    0x20
#define MASK_PXS_RXSRL_VALID6    0x40
#define MASK_PXS_RXSRL_VALID7    0x80

#define MASK_PXS_RX0CSSELR_RX0CSSEL 0x1F

#define MASK_PXS_RX1CSSELR_RX1CSSEL 0x1F

#define MASK_PXS_RX2CSSELR_RX2CSSEL 0x1F

#define MASK_PXS_RX3CSSELR_RX3CSSEL 0x1F

